label.global.seuip=Seu IP
label.global.bemvindos=Net Tools Live
label.global.bemvindos1=Ferramentas de rede online
label.global.aguarde=Aguarde...
label.global.informeurl=Informe a URL do video
label.global.informehost=Informe o Host
label.global.errodownloadvideo=Video privado ou incompat\u00EDvel.
text.global.peoplesearch=Encontre Pessoas com uma pesquisa profunda na internet, aonde voc\u00EA geralmente n\u00E3o encontraria. Nosso buscador \u00E9 sagaz.
text.global.ping=Ping \u00E9 um programa que utiliza o protocolo ICMP que envia pacotes para testar equipamentos ou redes de computadores.\nEle funciona enviando pacotes ao destino e aguardando a resposta. Com essa resposta \u00E9 calculado o tempo e as perdas de pacotes.
text.global.dirb=Penetration Test (Pen Test) \u00E9 utilizado para avalizar a seguran\u00E7a do seu sistema e faz uma an\u00E1lise de poss\u00EDveis vulnerabilidades.\nNosso verificador faz scanner em todos os diret\u00F3rios do seu site, exibindo caminhos para conseguir informa\u00E7\u00F5es sem efetuar o login de sistema.
text.global.sip=SIP (Sip test) \u00E9 um utilit\u00E1rio para efeturar um teste de conex\u00E3o utilizando o protocolo SIP / UDP. \n
text.global.snmp=SNMP \u00E9 um utilit\u00E1rio para efetuar test online de servidores a partir de um Community e OID.\nEsse protocolo \u00E9 utilizado para gerenciamento de dispositivos de Rede IP.
text.global.nmap=Nmap \u00E9 um utilit\u00E1rio que efetua port scan no seu servidor, exibindo as poss\u00EDveis vulnerabilidade a partir das portas abertas.\nInsira o seu IP ou URL e fique de cara.
text.global.nslookup=Nslookup \u00E9 um utilitario para consultar as informa\u00E7\u00F5es sobre algum DNS espec\u00EDficos.
text.global.whois=WHOIS consulta e exibe informa\u00E7\u00F5es sobre dominios na internet.  Qual a propriedade, qual pais de registro, qual servidor respons\u00E1vel. \u00C9 muito \u00FAtil para descobrir quem s\u00E3o os donos dos dom\u00EDnios.
text.global.videodownload=Ferramenta para download de videos com suporte aos principais sites. Insira a URL para que nosso software possa extrair, converter e disponibilizar para dowload. Na melhor qualidade poss\u00EDvel.
text.global.traceroute=Traceroute faz um diagn\u00F3stico do tr\u00E1fego dos pacotes da Internet utilizando os protocolos IP e ICMP.\nEle tra\u00E7a uma rota do destino e origem e exibindo quanto tempo e quais servidores esse pacote percorreu.\n\u00C9 muito util para analisar o motivo de demora em um acesso a um determinado servi\u00E7o.

textmin.global.peoplesearch=Encontre Pessoas com uma pesquisa profunda na internet, aonde voc\u00EA geralmente n\u00E3o encontraria. Nosso buscador \u00E9 sagaz.
textmin.global.ping=Ping \u00E9 um programa que utiliza o protocolo ICMP que envia pacotes para testar equipamentos ou redes de computadores....
textmin.global.dirb=Penetration Test (Pen Test) \u00E9 utilizado para avalizar a seguran\u00E7a do seu sistema e faz uma an\u00E1lise de poss\u00EDveis vulnerabilidades...
textmin.global.sip=SIP (Sip test) \u00E9 um utilit\u00E1rio para efeturar um teste de conex\u00E3o utilizando o protocolo SIP / UDP.
textmin.global.snmp=SNMP \u00E9 um utilit\u00E1rio para efetuar test online de servidores a partir de um Community e OID...
textmin.global.nmap=Nmap \u00E9 um utilit\u00E1rio que efetua port scan no seu servidor, exibindo as poss\u00EDveis vulnerabilidade...
textmin.global.nslookup=Nslookup \u00E9 um utilitario para consultar as informa\u00E7\u00F5es sobre algum DNS espec\u00EDficos...
textmin.global.whois=WHOIS consulta e exibe informa\u00E7\u00F5es sobre dominios na internet...
textmin.global.videodownload=Ferramenta para download de videos com suporte aos principais sites...
textmin.global.traceroute=Traceroute faz um diagn\u00F3stico do tr\u00E1fego dos pacotes da Internet utilizando os protocolos IP e ICMP...

label.global.ir=Ir
label.global.nomecompleto=Nome completo
label.global.redesocial=Rede Social
label.global.blogs=Artigos interessantes sobre TI 

artigo1.link = criando-um-cluster-em-kubernetes
artigo1.titulo = Criando um cluster em Kubernetes
artigo1.subtitulo = De forma fácil e rápida
artigo1.detalhes.p1 = Nesse artigo iremos criar um cluster em Kubernetes com 1 master e 3 workers.
artigo1.detalhes.p2 = 1 Host master respons\u00E1vel por gerenciar o cluster e 3 Workers que ser\u00E3o conectados ao cluster para a distribui\u00E7\u00E3o dos deployments.
artigo1.detalhes.p3 =Definir os hostname das m\u00E1quinas

artigo1.label.configuracao=Configura\u00E7\u00E3o
artigo1.label.instalacao=Instala\u00E7\u00E3o
artigo1.label.verificandoinstalacao=Verificando Instala\u00E7\u00E3o

artigo1.detalhes.p4=Executar os comandos abaixo em todas as m\u00E1quinas
artigo1.detalhes.p5=Efetue essa configura\u00E7\u00E3o somente na m\u00E1quina Master.
artigo1.detalhes.p6=Efetue essa configura\u00E7\u00E3o somente nos workers.
artigo1.detalhes.p7=Substitua os valores abaixo de acordo com o resultado do comando \u201Ckubeadm init\u201D acima
artigo1.detalhes.p8=Execute esse comando no master


artigo2.link = app-javaee8-kubernetes-high-availability
artigo2.titulo = JAVAEE8 / kubernetes \u2013 High availability
artigo2.subtitulo = Replicando a sess\u00E3o
artigo2.detalhes.p1 = App Java web (javaee8) utilizando Wildfly, PostgreSQL e Docker.
artigo2.detalhes.p2 = Rodando em Kubernetes e replicando a sess\u00E3o entre as instancias utilizando Kube Ping.
artigo2.detalhes.p3 =Clonar o reposit\u00F3rio do projeto

artigo2.label.configuracao=Configura\u00E7\u00E3o
artigo2.label.instalacao=Instala\u00E7\u00E3o
artigo2.label.verificandoinstalacao=Verificando Instala\u00E7\u00E3o

artigo2.detalhes.p4=Configure de acordo com seus dados de conex\u00E3o PostgreSQL
artigo2.detalhes.p5=Configure o Host corretamente
artigo2.detalhes.p6=Caso necessite cadastrar o host em sua m\u00E1quina\:
artigo2.detalhes.p7=Informe o IP do Kubernetes \u2013 NGINX \u2013 IngressController
artigo2.detalhes.p8=Entendendo o arquivo Dockerfile
artigo2.detalhes.p9=Na gera\u00E7\u00E3o do Docker build, ele vai copiar os arquivos do m\u00F3dulo KUBE PING, o arquivo standalone-full-ha.xml (com as informa\u00E7\u00F5es de datasource e host) e a build para os diret\u00F3rios correspondentes do wildfly.
artigo2.detalhes.p10=Al\u00E9m disso, vai definir o ENTRYPOINT do docker para docker-entrypoint.sh
artigo2.detalhes.p11=Cria\u00E7\u00E3o da build Docker e envio para o Docker Hub
artigo2.detalhes.p12=Arquivo 
artigo2.detalhes.p13=Altere o comando acima informando o seu reposit\u00F3rio no docker hub
artigo2.detalhes.p14=Configura\u00E7\u00E3o dos componentes Kubernetes
artigo2.detalhes.p15=Pr\u00E9 Requisitos\: Ter o Kubernetes e NGINX Ingress Controller instalados\:
artigo2.detalhes.p16=Instala\u00E7\u00E3o do Kubernetes
artigo2.detalhes.p17=Instala\u00E7\u00E3o do NGINX Controller
artigo2.detalhes.p18=Aplicando o arquivo jkubecluster-app.yaml
artigo2.detalhes.p19=Executar essa configura\u00E7\u00E3o no master
artigo2.detalhes.p20=Executando e testando a replica\u00E7\u00E3o de sess\u00E3o
artigo2.detalhes.p21=Foram criadas 3 r\u00E9plicas do nosso container.
artigo2.detalhes.p22=Vamos parar o POD jkubecluster-evandromoura-97d578665-wb5j8
artigo2.detalhes.p23=Efetuando o Refresh na p\u00E1gina ele vai ser redirecionado para outro POD e vai manter os valores da sess\u00E3o

artigo3.link = instalando-nginx-ingress-controller-no-kubernetes
artigo3.titulo = Instalando Nginx Ingress Controller no kubernetes
artigo3.subtitulo = Linha de frente http e https
artigo3.detalhes.p1 = Instalando o Nginx Ingress Controller para receber as chamadas http e https e redirecionar para o Service.
artigo3.detalhes.p2 = Fundamental para a disponibiliza\u00E7\u00E3o dos seus servi\u00E7os incluindo certificados de forma segura.
artigo3.detalhes.p3=Fa\u00E7a o download do seguinte arquivo de instala\u00E7\u00E3o\:
artigo3.detalhes.p4=Edite o arquivo para inserir o IP externo que vai responder pela porta 80
artigo3.detalhes.p5=Adicione o externalIPs

artigo3.label.configuracao=Configura\u00E7\u00E3o
artigo3.label.instalacao=Instala\u00E7\u00E3o
artigo3.label.verificandoinstalacao=Verificando Instala\u00E7\u00E3o



artigo4.link=desinstalar-completamente-o-kubernetes
artigo4.titulo=Desinstalar completamente o kubernetes
artigo4.subtitulo=Sem deixar nenhum registro.
artigo4.detalhes.p1=Uma forma r\u00E1pida e pr\u00E1tica para desinstalar o kubernetes.
artigo4.detalhes.p2=Sem deixar nenhum rastro.